#+title:     Ectorepo: Typescript
#+author:    David Conner
#+email:     noreply@te.xel.io

A list of Typescript repositories. To learn how to use this Repo repo, see the
the [[https://github.com/ectorepo/ectorepo][ectorepo/ectorepo]] Repo ... repo.

#+begin_src xml :tangle default.xml
<?xml version="1.0" encoding="utf-8"?>
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="typescript/astro.xml"/>
  <!-- typedoc -->
  <project name="kamiazya/typedoc-plugin-mermaid" path="typedoc/typedoc-plugin-mermaid" remote="github" revision="main"/>
  <project name="Gerrit0/typedoc-plugin-zod" path="typedoc/typedoc-plugin-zod" remote="github" revision="main"/>
  <project name="krisztianb/typedoc-umlclass" path="typedoc/typedoc-umlclass" remote="github" revision="master"/>
  <!-- zod -->
  <project name="colinhacks/zod" path="zod/zod" remote="github" revision="master"/>
  <project name="colinhacks/zod-deno" path="zod/zod-deno" remote="github" revision="main"/>
  <project name="samchungy/zod-openapi" path="zod/zod-openapi" remote="github" revision="master"/>
  <project name="asteasolutions/zod-to-openapi" path="zod/zod-to-openapi" remote="github" revision="master"/>
</manifest>
#+end_src

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

* GraphQL Params

#+name: nrepos
#+begin_src emacs-lisp :results replace value
"100"
#+end_src

#+RESULTS: nrepos
| 100 |

#+RESULTS: gitorg
: withastro

#+name: updatedAfter
#+header: :var date=(format-time-string "%Y-%m-%d" (seconds-to-time 0) t)
#+begin_src emacs-lisp :results replace value
date
#+end_src

#+RESULTS: updatedAfter
: 1970-01-01

** Astro
  :PROPERTIES:
  :header-args+: :var dataOrg="withastro"
  :END:

Get the core repositories. These should go into =/data/ecto/typescript/astro=.

#+name: astro-repos
#+begin_src emacs-lisp :results replace vector value :var nrepos=100 :exports code :noweb yes
(ghub-graphql
 (graphql-query ((organization
                  :arguments ((login . "<<dataGithubOrg(dataOrg="withastro")>>"))
                  (repositories
                   :arguments ((first . <<nrepos()>>)
                               (orderBy . ((field . UPDATED_AT)
                                           (direction . DESC))))
                   (edges
                    (node (owner login)
                          name
                          (defaultBranchRef prefix name)
                          url
                          updatedAt
                          isArchived)))))))
#+end_src

#+RESULTS: astro-repos
| data | (organization (repositories (edges ((node (owner (login . withastro)) (name . astro) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/astro) (updatedAt . 2024-02-18T21:30:58Z) (isArchived))) ((node (owner (login . withastro)) (name . docs) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/docs) (updatedAt . 2024-02-18T21:13:30Z) (isArchived))) ((node (owner (login . withastro)) (name . starlight) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/starlight) (updatedAt . 2024-02-18T18:03:02Z) (isArchived))) ((node (owner (login . withastro)) (name . prettier-plugin-astro) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/prettier-plugin-astro) (updatedAt . 2024-02-18T13:05:50Z) (isArchived))) ((node (owner (login . withastro)) (name . astro.build) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/astro.build) (updatedAt . 2024-02-17T05:09:11Z) (isArchived))) ((node (owner (login . withastro)) (name . contribute.docs.astro.build) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/contribute.docs.astro.build) (updatedAt . 2024-02-17T02:45:27Z) (isArchived))) ((node (owner (login . withastro)) (name . action-studio) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/action-studio) (updatedAt . 2024-02-16T21:03:23Z) (isArchived))) ((node (owner (login . withastro)) (name . github-pages) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/github-pages) (updatedAt . 2024-02-16T18:00:57Z) (isArchived))) ((node (owner (login . withastro)) (name . astro-ecosystem-ci) (defaultBranchRef (prefix . refs/heads/) (name . astro)) (url . https://github.com/withastro/astro-ecosystem-ci) (updatedAt . 2024-02-16T16:14:06Z) (isArchived))) ((node (owner (login . withastro)) (name . blog-tutorial-demo) (defaultBranchRef (prefix . refs/heads/) (name . complete)) (url . https://github.com/withastro/blog-tutorial-demo) (updatedAt . 2024-02-13T23:15:12Z) (isArchived))) ((node (owner (login . withastro)) (name . roadmap) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/roadmap) (updatedAt . 2024-02-13T12:23:56Z) (isArchived))) ((node (owner (login . withastro)) (name . adapters) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/adapters) (updatedAt . 2024-02-10T05:43:12Z) (isArchived))) ((node (owner (login . withastro)) (name . compiler) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/compiler) (updatedAt . 2024-02-10T05:10:25Z) (isArchived))) ((node (owner (login . withastro)) (name . houston-discord) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/houston-discord) (updatedAt . 2024-02-06T20:23:15Z) (isArchived))) ((node (owner (login . withastro)) (name . houston-vscode) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/houston-vscode) (updatedAt . 2024-02-04T06:19:45Z) (isArchived))) ((node (owner (login . withastro)) (name . action) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/action) (updatedAt . 2024-02-03T13:20:39Z) (isArchived))) ((node (owner (login . withastro)) (name . language-tools) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/language-tools) (updatedAt . 2024-02-02T10:32:31Z) (isArchived))) ((node (owner (login . withastro)) (name . houston.astro.build) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/houston.astro.build) (updatedAt . 2024-01-30T05:25:46Z) (isArchived))) ((node (owner (login . withastro)) (name . .github) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/.github) (updatedAt . 2024-01-27T04:15:42Z) (isArchived))) ((node (owner (login . withastro)) (name . astro.new) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/astro.new) (updatedAt . 2024-01-26T04:53:25Z) (isArchived))) ((node (owner (login . withastro)) (name . cli-kit) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/cli-kit) (updatedAt . 2024-01-22T03:58:01Z) (isArchived))) ((node (owner (login . withastro)) (name . site-kit) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/site-kit) (updatedAt . 2024-01-22T03:57:44Z) (isArchived))) ((node (owner (login . withastro)) (name . astro-repl) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/astro-repl) (updatedAt . 2024-01-16T01:06:33Z) (isArchived))) ((node (owner (login . withastro)) (name . automation) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/automation) (updatedAt . 2023-11-21T13:39:06Z) (isArchived))) ((node (owner (login . withastro)) (name . view-transitions-demo) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/view-transitions-demo) (updatedAt . 2023-10-12T13:34:17Z) (isArchived))) ((node (owner (login . withastro)) (name . wormhole) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/wormhole) (updatedAt . 2023-10-09T04:28:31Z) (isArchived))) ((node (owner (login . withastro)) (name . netlify-adapter) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/netlify-adapter) (updatedAt . 2023-09-27T19:02:47Z) (isArchived . t))) ((node (owner (login . withastro)) (name . astro-playground) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/astro-playground) (updatedAt . 2023-09-03T17:14:24Z) (isArchived))) ((node (owner (login . withastro)) (name . vite) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/vite) (updatedAt . 2023-09-03T17:13:26Z) (isArchived))) ((node (owner (login . withastro)) (name . vite-ecosystem-ci) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/vite-ecosystem-ci) (updatedAt . 2023-09-03T17:13:12Z) (isArchived))) ((node (owner (login . withastro)) (name . withastro.github.io) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/withastro.github.io) (updatedAt . 2023-08-04T02:35:34Z) (isArchived))) ((node (owner (login . withastro)) (name . discord-auto-threader) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/discord-auto-threader) (updatedAt . 2023-02-10T11:59:37Z) (isArchived))) ((node (owner (login . withastro)) (name . micromark-extension-mdx-jsx) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/withastro/micromark-extension-mdx-jsx) (updatedAt . 2022-06-10T11:54:25Z) (isArchived))) ((node (owner (login . withastro)) (name . codesandbox-client) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/withastro/codesandbox-client) (updatedAt . 2022-03-10T15:59:38Z) (isArchived)))))) |

**** Test

#+name: zodSnips
#+begin_example  json
{
  "Zod date max": {
    "prefix": ["zod_date_max", "date max"],
    "scope": "javascript,typescript",
    "body": "z.date().max(new Date())"
  },
  "Zod string optional": {
    "prefix": ["zod_string_optional", "string optional"],
    "scope": "javascript,typescript",
    "body": "z.optional(z.string())"
  },
  "Zod schema partial": {
    "prefix": ["zod_schema_partial", "schema partial"],
    "scope": "javascript,typescript",
    "body": "const $1 = ${2:schema}.partial();"
  }
}
#+end_example

# +headers: vars: tsxData=zodSnips

# -*- mode: snippet -*-
# name: 
# key: 
# uuid: 
# group: 
# --

#+name: convertCodeSnippets
#+begin_src jq :stdin zodSnips
. | to_entries
  | map({ group: "zod",
          name: (.key),
          prefix: .value.prefix[0],
          abbrev: (.value.prefix[0] | split("_") | map(.[0:2]) | .[1:2] | join("")) # as $abbrev)
        })
  | map(. + ({key: (.abbrev | @text "<Zo\(.)") }))
  | map(. + {snippet: @text "# -*- mode:snippet -*-\nname: \(.name)\nkey:\(.key)\ngroup: \(.group)"})

#
# key: (.value.prefix | @text "<ZO\(.[0] | sub(\"\"; \"\") )"),
#
# [.[0], .[1].data] as [$stat, $m] |
#  reduce ($stat | to_entries)[] as $s
# #  ({}; . += $m[$s[0]])
#   ({}; . += {($s.key): ($s.value + $m[$s.key])}) |
#   to_entries | map(.value)
#+end_src

#+RESULTS: convertCodeSnippets
#+begin_example
[
  {
    "group": "zod",
    "name": "Zod date max",
    "prefix": "zod_date_max",
    "abbrev": "da",
    "key": "<Zoda",
    "snippet": "# -*- mode:snippet -*-\nname: Zod date max\nkey:<Zoda\ngroup: zod"
  },
  {
    "group": "zod",
    "name": "Zod string optional",
    "prefix": "zod_string_optional",
    "abbrev": "st",
    "key": "<Zost",
    "snippet": "# -*- mode:snippet -*-\nname: Zod string optional\nkey:<Zost\ngroup: zod"
  },
  {
    "group": "zod",
    "name": "Zod schema partial",
    "prefix": "zod_schema_partial",
    "abbrev": "sc",
    "key": "<Zosc",
    "snippet": "# -*- mode:snippet -*-\nname: Zod schema partial\nkey:<Zosc\ngroup: zod"
  }
]
#+end_example

